package javafullstack.chap06.sec06;

/**
 * packageName : javafullstack.chap06.sec06
 * fileName : Car
 * author : hyuk
 * date : 2022/09/28
 * description : 패키지?
 * ===========================================================
 * DATE            AUTHOR             NOTE
 * —————————————————————————————
 * 2022/09/28         hyuk          최초 생성
 */
public class Car {
//    package chap06.sec06;
//    ✅패키지 : 일종의 폴더와 비슷.
//    ✅패키지구조 : 상위패키지.하위패키지.클래스
//    ✅자바에서 전체 클래스 명 : 패키지명+클래스명 👉 이게 진짜 클래스명
//    ✅클래스에 패키지를 사용하면 : 제일 위에 패키지를 선언해야함
//    ✅패키지 선언 : package 상위패키지.하위패키지;
//                public class Sample{...}

}
